Revit 2027 API
BuiltInFailures.EditingFailures.CannotRotateLocked Property
 Can't rotate pinned element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotRotateLocked { get; }
Public Shared ReadOnly Property CannotRotateLocked As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotRotateLocked {
	FailureDefinitionId^ get ();
}
static member CannotRotateLocked : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace